In [1]:
import pandas as pd

In [3]:
a1 = pd.Series([10,20,30,40,50])

In [4]:
a1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
type(a1)

pandas.core.series.Series

In [6]:
a1 = pd.Series([10,20,30,40,50],index=([1,2,3,4,5]))

In [7]:
a1

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [9]:
s1 = pd.Series({'a':10,'b':20,'o':70})

In [10]:
s1

a    10
b    20
o    70
dtype: int64

In [13]:
s1 = pd.Series({'a':10,'b':20,'o':70},index = ['q','u','t','a','b'])

In [14]:
s1

q     NaN
u     NaN
t     NaN
a    10.0
b    20.0
dtype: float64

In [15]:
aa = pd.Series([1,2,3,4,5,6,7,8,9])

In [16]:
aa[4]

5

In [17]:
aa[:6]

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [18]:
aa[-7:]

2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [1]:
aa

NameError: name 'aa' is not defined

In [2]:
import pandas as pd

In [3]:
aa

NameError: name 'aa' is not defined

In [4]:
aa = pd.Series([1,2,3,4,5])

In [5]:
aa +5

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [6]:
bb = pd.Series([10,20,30,40,50])

In [7]:
aa + bb

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [9]:
qq = pd.DataFrame({'name':['hamid','jahid','shafique','ijhaar','sameer'],'age':[80,55,45,23,22]})

In [10]:
qq

       name  age
0     hamid   80
1     jahid   55
2  shafique   45
3    ijhaar   23
4    sameer   22

In [1]:
import pandas as pd

In [5]:
ss = pd.DataFrame({'name':['hamid ali','zahida bano','jahid ali','shafique ali','azeeza bano','sameer ali','faizan ali','gajala bano'],'age':[80,70,55,45,40,23,22,17]})

In [6]:
ss

           name  age
0     hamid ali   80
1   zahida bano   70
2     jahid ali   55
3  shafique ali   45
4   azeeza bano   40
5    sameer ali   23
6    faizan ali   22
7   gajala bano   17

In [1]:
import pandas as pd

In [3]:
tt =pd.read_csv("C:\\Users\\lenovo\\Documents\\Book1.csv")

In [4]:
tt

           NAME  AGE  RELATION
0     HAMID ALI   80      DADA
1   JAHIDA BANO   75      DADI
2     JAHID ALI   55  BDE PAPA
3  SHAFIQUE ALI   45      PAPA
4   AZEEZA BANO   40      AMMI
5    SAMEER ALI   23      BHAI
6    FAIZAN ALI   22    MYSELF
7   GAJALA BANO   17     BEHAN

In [5]:
tt.head()

           NAME  AGE  RELATION
0     HAMID ALI   80      DADA
1   JAHIDA BANO   75      DADI
2     JAHID ALI   55  BDE PAPA
3  SHAFIQUE ALI   45      PAPA
4   AZEEZA BANO   40      AMMI

In [6]:
tt.tail()

           NAME  AGE RELATION
3  SHAFIQUE ALI   45     PAPA
4   AZEEZA BANO   40     AMMI
5    SAMEER ALI   23     BHAI
6    FAIZAN ALI   22   MYSELF
7   GAJALA BANO   17    BEHAN

In [8]:
tt.shape

(8, 3)

In [11]:
tt.describe()

             AGE
count   8.000000
mean   44.625000
std    24.041259
min    17.000000
25%    22.750000
50%    42.500000
75%    60.000000
max    80.000000

In [12]:
ss = pd.DataFrame({'name':['hamid ali','zahida bano','jahid ali','shafique ali','azeeza bano','sameer ali','faizan ali','gajala bano'],'age':[80,70,55,45,40,23,22,17]})

In [13]:
ss

           name  age
0     hamid ali   80
1   zahida bano   70
2     jahid ali   55
3  shafique ali   45
4   azeeza bano   40
5    sameer ali   23
6    faizan ali   22
7   gajala bano   17

In [14]:
ss.head()

           name  age
0     hamid ali   80
1   zahida bano   70
2     jahid ali   55
3  shafique ali   45
4   azeeza bano   40

In [15]:
ss.tail()

           name  age
3  shafique ali   45
4   azeeza bano   40
5    sameer ali   23
6    faizan ali   22
7   gajala bano   17

In [16]:
ss.shape

(8, 2)

In [1]:
import pandas as pd

In [3]:
ww = pd.read_csv("C:\\Users\\lenovo\\Documents\\Book1.csv")

In [4]:
ww

           NAME  AGE  RELATION  RANK
0     HAMID ALI   80      DADA     1
1   JAHIDA BANO   75      DADI     2
2     JAHID ALI   55  BDE PAPA     3
3  SHAFIQUE ALI   45      PAPA     4
4   AZEEZA BANO   40      AMMI     5
5    SAMEER ALI   23      BHAI     6
6    FAIZAN ALI   22    MYSELF     7
7   GAJALA BANO   17     BEHAN     8

In [5]:
ww.head()

           NAME  AGE  RELATION  RANK
0     HAMID ALI   80      DADA     1
1   JAHIDA BANO   75      DADI     2
2     JAHID ALI   55  BDE PAPA     3
3  SHAFIQUE ALI   45      PAPA     4
4   AZEEZA BANO   40      AMMI     5

In [6]:
ww.tail()

           NAME  AGE RELATION  RANK
3  SHAFIQUE ALI   45     PAPA     4
4   AZEEZA BANO   40     AMMI     5
5    SAMEER ALI   23     BHAI     6
6    FAIZAN ALI   22   MYSELF     7
7   GAJALA BANO   17    BEHAN     8

In [7]:
ww.shape

(8, 4)

In [11]:
ww.iloc[0:4,0:3]

           NAME  AGE  RELATION
0     HAMID ALI   80      DADA
1   JAHIDA BANO   75      DADI
2     JAHID ALI   55  BDE PAPA
3  SHAFIQUE ALI   45      PAPA

In [13]:
ww.loc[0:5,("NAME","RELATION")]

           NAME  RELATION
0     HAMID ALI      DADA
1   JAHIDA BANO      DADI
2     JAHID ALI  BDE PAPA
3  SHAFIQUE ALI      PAPA
4   AZEEZA BANO      AMMI
5    SAMEER ALI      BHAI

In [16]:
ww

           NAME  AGE  RELATION  RANK
0     HAMID ALI   80      DADA     1
1   JAHIDA BANO   75      DADI     2
2     JAHID ALI   55  BDE PAPA     3
3  SHAFIQUE ALI   45      PAPA     4
4   AZEEZA BANO   40      AMMI     5
5    SAMEER ALI   23      BHAI     6
6    FAIZAN ALI   22    MYSELF     7
7   GAJALA BANO   17     BEHAN     8

In [20]:
ww.drop("RANK",axis=1)

           NAME  AGE  RELATION
0     HAMID ALI   80      DADA
1   JAHIDA BANO   75      DADI
2     JAHID ALI   55  BDE PAPA
3  SHAFIQUE ALI   45      PAPA
4   AZEEZA BANO   40      AMMI
5    SAMEER ALI   23      BHAI
6    FAIZAN ALI   22    MYSELF
7   GAJALA BANO   17     BEHAN

In [21]:
ww

           NAME  AGE  RELATION  RANK
0     HAMID ALI   80      DADA     1
1   JAHIDA BANO   75      DADI     2
2     JAHID ALI   55  BDE PAPA     3
3  SHAFIQUE ALI   45      PAPA     4
4   AZEEZA BANO   40      AMMI     5
5    SAMEER ALI   23      BHAI     6
6    FAIZAN ALI   22    MYSELF     7
7   GAJALA BANO   17     BEHAN     8

In [23]:
ww.drop([2,5],axis=0)

           NAME  AGE RELATION  RANK
0     HAMID ALI   80     DADA     1
1   JAHIDA BANO   75     DADI     2
3  SHAFIQUE ALI   45     PAPA     4
4   AZEEZA BANO   40     AMMI     5
6    FAIZAN ALI   22   MYSELF     7
7   GAJALA BANO   17    BEHAN     8

In [1]:
import pandas as pd

In [2]:
aa = pd.read_csv("C:\\Users\\lenovo\\Documents\\Book1.csv")

In [3]:
aa

           NAME  AGE  RELATION  RANK
0     HAMID ALI   80      DADA     1
1   JAHIDA BANO   75      DADI     2
2     JAHID ALI   55  BDE PAPA     3
3  SHAFIQUE ALI   45      PAPA     4
4   AZEEZA BANO   40      AMMI     5
5    SAMEER ALI   23      BHAI     6
6    FAIZAN ALI   22    MYSELF     7
7   GAJALA BANO   17     BEHAN     8

In [4]:
aa.discribe()

AttributeError: 'DataFrame' object has no attribute 'discribe'

In [5]:
aa.mean()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_12184\4149838814.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  aa.mean()

AGE     44.625
RANK     4.500
dtype: float64

In [6]:
aa.median()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_12184\415783020.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  aa.median()

AGE     42.5
RANK     4.5
dtype: float64

In [7]:
aa.min()

NAME        AZEEZA BANO
AGE                  17
RELATION           AMMI
RANK                  1
dtype: object

In [8]:
aa

           NAME  AGE  RELATION  RANK
0     HAMID ALI   80      DADA     1
1   JAHIDA BANO   75      DADI     2
2     JAHID ALI   55  BDE PAPA     3
3  SHAFIQUE ALI   45      PAPA     4
4   AZEEZA BANO   40      AMMI     5
5    SAMEER ALI   23      BHAI     6
6    FAIZAN ALI   22    MYSELF     7
7   GAJALA BANO   17     BEHAN     8

In [9]:
aa.max()

NAME        SHAFIQUE ALI
AGE                   80
RELATION            PAPA
RANK                   8
dtype: object

In [10]:
def half(e):
    return e/2

In [11]:
aa[["AGE"]].apply (half)

    AGE
0  40.0
1  37.5
2  27.5
3  22.5
4  20.0
5  11.5
6  11.0
7   8.5

In [12]:
def double_make(e):
    return e*2

In [13]:
aa[["AGE"]].apply(double_make)

   AGE
0  160
1  150
2  110
3   90
4   80
5   46
6   44
7   34

In [14]:
aa["NAME"].value_counts()

HAMID ALI       1
JAHIDA BANO     1
JAHID ALI       1
SHAFIQUE ALI    1
AZEEZA BANO     1
SAMEER ALI      1
FAIZAN ALI      1
GAJALA BANO     1
Name: NAME, dtype: int64

In [15]:
aa.sort_values(by="AGE")

           NAME  AGE  RELATION  RANK
7   GAJALA BANO   17     BEHAN     8
6    FAIZAN ALI   22    MYSELF     7
5    SAMEER ALI   23      BHAI     6
4   AZEEZA BANO   40      AMMI     5
3  SHAFIQUE ALI   45      PAPA     4
2     JAHID ALI   55  BDE PAPA     3
1   JAHIDA BANO   75      DADI     2
0     HAMID ALI   80      DADA     1